In [2]:
import pandas as pd

In [3]:
s=pd.Series(["a","b","c"])

In [4]:
s

0    a
1    b
2    c
dtype: object

In [12]:
df=pd.DataFrame(['x','y','z'],columns=['name'],index=[100,200,300])

In [13]:
df

    name
100    x
200    y
300    z

In [8]:
import numpy as np

In [9]:
from numpy import random

In [10]:
d=pd.DataFrame(np.random.randn(3,4),columns=['col1','col2','col3','col4'])

In [15]:
d

       col1      col2      col3      col4
0  0.128757 -0.312578  0.637187 -0.701397
1  0.343258  0.092511  0.917193  0.221858
2  0.166618  0.118596  1.676250 -0.369136

In [ ]:
#access
loc[]
iloc[]

In [16]:
x=d.loc[2]

In [17]:
x

col1    0.166618
col2    0.118596
col3    1.676250
col4   -0.369136
Name: 2, dtype: float64

In [18]:
y=d.iloc[2]

In [19]:
y

col1    0.166618
col2    0.118596
col3    1.676250
col4   -0.369136
Name: 2, dtype: float64

In [20]:
d['col4']=d['col1']+d['col2']

In [21]:
d

       col1      col2      col3      col4
0  0.128757 -0.312578  0.637187 -0.183820
1  0.343258  0.092511  0.917193  0.435769
2  0.166618  0.118596  1.676250  0.285214

In [22]:
d.shape

(3, 4)

In [23]:
d.size

12

In [24]:
type(d)

pandas.core.frame.DataFrame

In [25]:
type(d['col1'])

pandas.core.series.Series

In [27]:
#load data from dataset
data=pd.read_excel("dataset.xlsx")

In [28]:
data

   name  age  stresss
0   ram   20        1
1  sai    30        0
2    dy   40        1

In [ ]:
#06/02/2023
#pandas operation
#conditional selection
#access rows and columns
#add & delete columns
#concatenating merging,joining dataframes
#handling missing values
#apply()

In [7]:
import pandas as pd
import numpy as np

In [21]:
d={'USN':[100,101,102],
  'Name':['jerry','tom','ramesh'],
  'Mobile':[98,88,77],
  'Marks':[30,35,32]
  }

In [10]:
std=pd.DataFrame(d)

In [11]:
std

   USN    Name  Mobile  Marks
0  100   jerry      98     30
1  101     tom      88     35
2  102  ramesh      77     32

In [12]:
#dataframe operations
std.head(2)

   USN   Name  Mobile  Marks
0  100  jerry      98     30
1  101    tom      88     35

In [13]:
std.head()
#head- display rows
#display all by default
#parameter passed, display rows as per parameters

   USN    Name  Mobile  Marks
0  100   jerry      98     30
1  101     tom      88     35
2  102  ramesh      77     32

In [16]:
std.columns
#list the columns of my dataframe

Index(['USN', 'Name', 'Mobile', 'Marks'], dtype='object')

In [14]:
std.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    3 non-null      object
 2   Mobile  3 non-null      int64
 3   Marks   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [17]:
std.isnull()
#this function will give the boolean data of table

     USN   Name  Mobile  Marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [18]:
std['USN']

0    100
1    101
2    102
Name: USN, dtype: int64

In [19]:
std[['USN','Marks']]
#acess multiple columns

   USN  Marks
0  100     30
1  101     35
2  102     32

In [26]:
std.loc[1]

USN       101
Name      tom
Mobile     88
Marks      35
Name: 1, dtype: object

In [25]:
std.loc[[1,2]]
#return row

   USN    Name  Mobile  Marks
1  101     tom      88     35
2  102  ramesh      77     32

In [91]:
#create a dataframe cars having the attributes (car_id,car_name,)
a={
    
    'car_id':[101,102,103,104,105,106],
    'car_name':['kia','tata','hundai','honda',None,None],
    'car_power':[1000,1200,1400,1100,None,900]
}

In [92]:
car=pd.DataFrame(a)

In [93]:
car

   car_id car_name  car_power
0     101      kia     1000.0
1     102     tata     1200.0
2     103   hundai     1400.0
3     104    honda     1100.0
4     105     None        NaN
5     106     None      900.0

In [31]:
car['car_id']

0    101
1    102
2    103
3    104
4    105
Name: car_id, dtype: int64

In [30]:
car.columns

Index(['car_id', 'car_name'], dtype='object')

In [33]:
car.loc[0]

car_id      101
car_name    kia
Name: 0, dtype: object

In [34]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   car_id    5 non-null      int64
 1   car_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [55]:
car.isnull()

   car_id  car_name
0   False     False
1   False     False
2   False     False
3   False     False
4   False     False
5   False      True

In [56]:
car.iloc[2]

car_id         103
car_name    hundai
Name: 2, dtype: object

In [57]:
car.loc[2]

car_id         103
car_name    hundai
Name: 2, dtype: object

In [58]:
index=['A','B','C','D','E','F']
car.set_index('car_id')

       car_name
car_id
101         kia
102        tata
103      hundai
104       honda
105         BMW
106        None

In [59]:
car

   car_id car_name
0     101      kia
1     102     tata
2     103   hundai
3     104    honda
4     105      BMW
5     106     None

In [66]:
#conditional selection
#to print certain values of our condition
b=car['car_power']<1200

In [67]:
car[b]

   car_id car_name  car_power
0     101      kia       1000
3     104    honda       1100
5     106     None        900

In [69]:
c=car[b]['car_name']

In [70]:
c

0      kia
3    honda
5     None
Name: car_name, dtype: object

In [72]:
car[(car['car_name']=='kia')&(car['car_power']>900)]

   car_id car_name  car_power
0     101      kia       1000

In [74]:
car[(car['car_id']>100)&(car['car_power']<1200)]

   car_id car_name  car_power
0     101      kia       1000
3     104    honda       1100
5     106     None        900

In [76]:
#adding a new column
f='mumbai,delhi,vizag,bnglr,goa,raipur'.split(',')
print(f,type(f))

['mumbai', 'delhi', 'vizag', 'bnglr', 'goa', 'raipur'] <class 'list'>

In [77]:
car['city']=f

In [78]:
f

['mumbai', 'delhi', 'vizag', 'bnglr', 'goa', 'raipur']

In [79]:
car

   car_id car_name  car_power    city
0     101      kia       1000  mumbai
1     102     tata       1200   delhi
2     103   hundai       1400   vizag
3     104    honda       1100   bnglr
4     105      BMW       1300     goa
5     106     None        900  raipur

#to permantly delete a column

In [80]:
#axis[1]=permanent deletion of  coloumn
car.drop('city',axis=1,inplace=True)

In [81]:
car

   car_id car_name  car_power
0     101      kia       1000
1     102     tata       1200
2     103   hundai       1400
3     104    honda       1100
4     105      BMW       1300
5     106     None        900

In [82]:
car.drop(5)

   car_id car_name  car_power
0     101      kia       1000
1     102     tata       1200
2     103   hundai       1400
3     104    honda       1100
4     105      BMW       1300

In [83]:
car

   car_id car_name  car_power
0     101      kia       1000
1     102     tata       1200
2     103   hundai       1400
3     104    honda       1100
4     105      BMW       1300
5     106     None        900

In [84]:
#axis[0]=permanent deletion of  row
car.drop(5,axis=0,inplace=True)

In [85]:
car

   car_id car_name  car_power
0     101      kia       1000
1     102     tata       1200
2     103   hundai       1400
3     104    honda       1100
4     105      BMW       1300

In [89]:
#two methods dropna(),fillna() to delete the missing values
car.dropna()

   car_id car_name  car_power
0     101      kia       1000
1     102     tata       1200
2     103   hundai       1400
3     104    honda       1100

In [94]:
car

   car_id car_name  car_power
0     101      kia     1000.0
1     102     tata     1200.0
2     103   hundai     1400.0
3     104    honda     1100.0
4     105     None        NaN
5     106     None      900.0

In [99]:
car.dropna(thresh=2)

   car_id car_name  car_power
0     101      kia     1000.0
1     102     tata     1200.0
2     103   hundai     1400.0
3     104    honda     1100.0
5     106     None      900.0